TuonyLiu/nxp/SDK_2.4.1_EasyARM-RT1052-V1_0/boards/EasyARM-RT1052-V1_0/emwin_examples/emwin_gui_sd_resource_ili9806e_png/pin_mux.c
                                                            Open Drain Enable Field: Open Drain Disabled
                                                            Pull / Keep Enable Field: Pull/Keeper Enabled
                                                            Pull / Keep Select Field: Pull
                                                            Pull Up / Down Config. Field: 100K Ohm Pull Up
                                                            Hyst. Enable Field: Hysteresis Enabled */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_B0_12_LCD_DATA08,    /* GPIO_B0_12 PAD functional properties : */
                        0x01B0B0u);                      /* Slew Rate Field: Slow Slew Rate
                                                            Drive Strength Field: R0/6
                                                            Speed Field: medium(100MHz)
                                                            Open Drain Enable Field: Open Drain Disabled
                                                            Pull / Keep Enable Field: Pull/Keeper Enabled
                                                            Pull / Keep Select Field: Pull
                                                            Pull Up / Down Config. Field: 100K Ohm Pull Up
                                                            Hyst. Enable Field: Hysteresis Enabled */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_B0_13_LCD_DATA09,    /* GPIO_B0_13 PAD functional properties : */
                        0x01B0B0u);                      /* Slew Rate Field: Slow Slew Rate
                                                            Drive Strength Field: R0/6
                                                            Speed Field: medium(100MHz)
                                                            Open Drain Enable Field: Open Drain Disabled
                                                            Pull / Keep Enable Field: Pull/Keeper Enabled
                                                            Pull / Keep Select Field: Pull
                                                            Pull Up / Down Config. Field: 100K Ohm Pull Up
                                                            Hyst. Enable Field: Hysteresis Enabled */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_B0_14_LCD_DATA10,    /* GPIO_B0_14 PAD functional properties : */
                        0x01B0B0u);                      /* Slew Rate Field: Slow Slew Rate
                                                            Drive Strength Field: R0/6
                                                            Speed Field: medium(100MHz)
                                                            Open Drain Enable Field: Open Drain Disabled
                                                            Pull / Keep Enable Field: Pull/Keeper Enabled
                                                            Pull / Keep Select Field: Pull
                                                            Pull Up / Down Config. Field: 100K Ohm Pull Up
                                                            Hyst. Enable Field: Hysteresis Enabled */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_B0_15_LCD_DATA11,    /* GPIO_B0_15 PAD functional properties : */
                        0x01B0B0u);                      /* Slew Rate Field: Slow Slew Rate
                                                            Drive Strength Field: R0/6
                                                            Speed Field: medium(100MHz)
                                                            Open Drain Enable Field: Open Drain Disabled
                                                            Pull / Keep Enable Field: Pull/Keeper Enabled
                                                            Pull / Keep Select Field: Pull
                                                            Pull Up / Down Config. Field: 100K Ohm Pull Up
                                                            Hyst. Enable Field: Hysteresis Enabled */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_B1_00_LCD_DATA12,    /* GPIO_B1_00 PAD functional properties : */
                        0x01B0B0u);                      /* Slew Rate Field: Slow Slew Rate
                                                            Drive Strength Field: R0/6
                                                            Speed Field: medium(100MHz)
                                                            Open Drain Enable Field: Open Drain Disabled
                                                            Pull / Keep Enable Field: Pull/Keeper Enabled
                                                            Pull / Keep Select Field: Pull
                                                            Pull Up / Down Config. Field: 100K Ohm Pull Up
                                                            Hyst. Enable Field: Hysteresis Enabled */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_B1_01_LCD_DATA13,    /* GPIO_B1_01 PAD functional properties : */
                        0x01B0B0u);                      /* Slew Rate Field: Slow Slew Rate
                                                            Drive Strength Field: R0/6
                                                            Speed Field: medium(100MHz)
                                                            Open Drain Enable Field: Open Drain Disabled
                                                            Pull / Keep Enable Field: Pull/Keeper Enabled
                                                            Pull / Keep Select Field: Pull
                                                            Pull Up / Down Config. Field: 100K Ohm Pull Up
                                                            Hyst. Enable Field: Hysteresis Enabled */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_B1_02_LCD_DATA14,    /* GPIO_B1_02 PAD functional properties : */
                        0x01B0B0u);                      /* Slew Rate Field: Slow Slew Rate
                                                            Drive Strength Field: R0/6
                                                            Speed Field: medium(100MHz)
                                                            Open Drain Enable Field: Open Drain Disabled
                                                            Pull / Keep Enable Field: Pull/Keeper Enabled
                                                            Pull / Keep Select Field: Pull
                                                            Pull Up / Down Config. Field: 100K Ohm Pull Up
                                                            Hyst. Enable Field: Hysteresis Enabled */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_B1_03_LCD_DATA15,    /* GPIO_B1_03 PAD functional properties : */
                        0x01B0B0u);                      /* Slew Rate Field: Slow Slew Rate
                                                            Drive Strength Field: R0/6
                                                            Speed Field: medium(100MHz)
                                                            Open Drain Enable Field: Open Drain Disabled
                                                            Pull / Keep Enable Field: Pull/Keeper Enabled
                                                            Pull / Keep Select Field: Pull
                                                            Pull Up / Down Config. Field: 100K Ohm Pull Up
                                                            Hyst. Enable Field: Hysteresis Enabled */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_B1_14_GPIO2_IO30,    /* GPIO_B1_15 PAD functional properties : */
                        0x10B0u);                        /* Slew Rate Field: Slow Slew Rate
                                                            Drive Strength Field: R0/6
                                                            Speed Field: medium(100MHz)
                                                            Open Drain Enable Field: Open Drain Disabled
                                                            Pull / Keep Enable Field: Pull/Keeper Enabled
                                                            Pull / Keep Select Field: Keeper
                                                            Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                            Hyst. Enable Field: Hysteresis Disabled */

